In [78]:
import pandas as pd

In [79]:
df = pd.read_csv('data/납 월별 도시별 대기오염도.csv',encoding='ansi')

In [80]:
df.head(3)

,구분,항목,단위,2013.01 월,2013.02 월,2013.03 월,2013.04 월,2013.05 월,2013.06 월,2013.07 월,...,2022.06 월,2022.07 월,2022.08 월,2022.09 월,2022.10 월,2022.11 월,2022.12 월,2023.01 월,2023.02 월,Unnamed: 125
0,대흥동,Pb,NaN,0.0839,0.0959,0.1009,0.0940,0.1116,0.0676,0.0866,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,성수동,Pb,NaN,0.0846,0.0420,0.1215,0.1385,0.1506,0.1120,0.0342,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,마포구,Pb,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,.0034,.0119,.0196,.0074,.0132,.0203,.0237,.0324,.04326,NaN

In [81]:
long_df = df.melt(id_vars=['구분', '항목','단위'], 
                  var_name='STD_YYYYMM', 
                  value_name='납')

In [82]:
long_df.head(3)

    구분  항목  단위 STD_YYYYMM       납
0  대흥동  Pb NaN  2013.01 월  0.0839
1  성수동  Pb NaN  2013.01 월  0.0846
2  마포구  Pb NaN  2013.01 월     NaN

In [83]:
df = long_df.drop(['구분', '항목', '단위'], axis=1)
df.head(3)

  STD_YYYYMM       납
0  2013.01 월  0.0839
1  2013.01 월  0.0846
2  2013.01 월     NaN

In [84]:
df['STD_YYYYMM'] = df['STD_YYYYMM'].str.replace('월', '')
df.head(3)

  STD_YYYYMM       납
0   2013.01   0.0839
1   2013.01   0.0846
2   2013.01      NaN

In [85]:
transposed_df = df.transpose()
transposed_df.head(3)

,0,1,2,3,4,5,6,7,8,9,...,13766,13767,13768,13769,13770,13771,13772,13773,13774,13775
STD_YYYYMM,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,...,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125
납,0.0839,0.0846,NaN,NaN,NaN,0.0673,NaN,0.109,0.1022,0.0836,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [87]:
df = transposed_df.rename(columns=transposed_df.iloc[0])        #첫번째 행을 column으로 지정
df.head(3)

,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,...,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125
STD_YYYYMM,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,...,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125
납,0.0839,0.0846,NaN,NaN,NaN,0.0673,NaN,0.109,0.1022,0.0836,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [88]:
df = df.drop(df.index[0])        #첫번째 행을 삭제한다
df

,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,2013.01,...,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125,Unnamed: 125
납,0.0839,0.0846,NaN,NaN,NaN,0.0673,NaN,0.109,0.1022,0.0836,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [89]:
df.to_csv('data/납_2.csv', index=True)